<?php

namespace Database\Seeders;

use App\Models\UserPosition;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;

class UserPositionsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $userPositions =[
            ['name' => 'รองกรรมการผู้จัดการ'],
            ['name' => 'ผู้จัดการฝ่ายจัดการ'],
            ['name' => 'ผู้จัดการทั่วไป'],
            ['name' => 'ผู้จัดการแผนก (วิศวกรรม)'],
            ['name' => 'หัวหน้าแผนก (วิศวกรรม)  L/R'],
            ['name' => 'รองหัวหน้าแผนก (วิศวกรรม)  โรงงานแปรรูป'],
            ['name' => 'เจ้าหน้าที่แผนก (วิศวกรรม)  โรงงานแปรรูป'],
            ['name' => 'เจ้าหน้าที่แผนก (วิศวกรรม)  H/R'],
            ['name' => 'เจ้าหน้าที่แผนก (วิศวกรรม)  L/R'],
            ['name' => 'เจ้าหน้าที่แผนก (วิศวกรรม)  สำนักงาน'],
            ['name' => 'เจ้าหน้าที่แผนกวิศวกรรม (สโตร์)'],
            ['name' => 'พนักงานทั่วไป (ช่าง)'],
            ['name' => 'ผู้จัดการแผนกเทคนิค'],
            ['name' => 'เจ้าหน้าที่ห้องปฎิบัติการ'],
            ['name' => 'เจ้าหน้าที่ศูนย์เอกสารและเจ้าหน้าที่เทคนิค'],
            ['name' => 'เจ้าหน้าที่เทคนิค'],
            ['name' => 'เจ้าหน้าที่ห้องปฎิบัติการ'],
            ['name' => 'เจ้าหน้าที่ SHIPPING'],
            ['name' => 'เจ้าหน้าที่ธุรการ'],
            ['name' => 'พนักงานทั่วไป (ธุรการ)'],
            ['name' => 'พนักงานทั่วไป (ธุรการ) พิการ'],
            ['name' => 'สมุห์บัญชี'],
            ['name' => 'เจ้าหน้าที่บัญชี (เจ้าหนี้)'],
            ['name' => 'เจ้าหน้าที่บัญชี (STOCK)'],
            ['name' => 'เจ้าหน้าที่บัญชี  (ต้นทุน)'],
            ['name' => 'เจ้าหน้าที่เงินเดือน'],
            ['name' => 'เจ้าหน้าที่สรรหาบุคคลากรและสวัสดิการ'],
            ['name' => 'เจ้าหน้าที่ฝึกอบรม'],
            ['name' => 'เจ้าหน้าที่บุคคล'],
            ['name' => 'ผู้จัดการแผนกควบคุมคุณภาพ'],
            ['name' => 'ผู้ช่วยผู้จัดการแผนกควบคุมคุณภาพ'],
            ['name' => 'หัวหน้าแผนกควบคุมคุณภาพ (H/R)'],
            ['name' => 'เจ้าหน้าที่แผนกควบคุมคุณภาพ (ผลิตดิบ)'],
            ['name' => 'เจ้าหน้าที่แผนกควบคุมคุณภาพ (M/R)'],
            ['name' => 'เจ้าหน้าที่แผนกควบคุมคุณภาพ (L/R)'],
            ['name' => 'เจ้าหน้าที่แผนกควบคุมคุณภาพ (H/R)'],
            ['name' => 'เจ้าหน้าที่แผนกควบคุมคุณภาพ (สำนักงาน)'],
            ['name' => 'พนักงานทั่วไป (คิวซี)  ผลิตดิบ'],
            ['name' => 'ผู้จัดการโรงงานอาหารสุก'],
            ['name' => 'รองผู้จัดการแผนกโรงงานอาหารสุก, หัวหน้าทีม IA'],
            ['name' => 'รองหัวหน้าส่วนคลังสินค้า'],
            ['name' => 'หัวหน้าห้องเตรียมบรรจุภัณฑ์'],
            ['name' => 'เจ้าหน้าที่วางแผนการผลิต'],
            ['name' => 'รองหัวหน้าผลิต (LOW RISK)'],
            ['name' => 'รองหัวหน้าผลิต (HIGH RISK)'],
            ['name' => 'รองหัวหน้าผลิต ส่วน Boxing (H/R)'],
            ['name' => 'รองหัวหน้าผลิต (เตรียมบรรจุภัณฑ์)'],
            ['name' => 'CHECKER ผลิตสุก HIGH RISK'],
            ['name' => 'พนักงานทั่วไป (ผลิตสุก) H/R'],
            ['name' => 'CHECKER ผลิตสุก LOW RISK'],
            ['name' => 'พนักงานทั่วไป (ผลิตสุก) L/R'],
            ['name' => 'CHECKER ห้อง BOXING (H/R)'],
            ['name' => 'พนักงานทั่วไป ห้อง BOXING (H/R)'],
            ['name' => 'CHECKER (บรรจุภัณฑ์) H/R'],
            ['name' => 'พนักงานทั่วไป (บรรจุภัณฑ์) H/R'],
            ['name' => 'CHECKER (โหลด) H/R'],
            ['name' => 'พนักงานทั่วไป (โหลดสินค้า) H/R'],
            ['name' => 'ผู้จัดการแผนกวิจัยและพัฒนาผลิตภัณฑ์'],
            ['name' => 'ผู้ช่วยผู้จัดการแผนกวิจัยและพัฒนาผลิตภัณฑ์'],
            ['name' => 'หัวหน้าแผนกวิจัยและพัฒนาผลิตภัณฑ์'],
            ['name' => 'เจ้าหน้าที่วิจัยและพัฒนาผลิตภัณฑ์'],
            ['name' => 'พนักงานทั่วไป (วิจัยและพัฒนาผลิตภัณฑ์)'],
            ['name' => 'หัวหน้าคลังบรรจุภัณฑ์'],
            ['name' => 'เจ้าหน้าที่คลังสินค้า'],
            ['name' => 'หัวหน้าคลังเครื่องปรุง'],
            ['name' => 'รองหัวหน้าฝ่ายจัดซื้อ'],
            ['name' => 'เจ้าหน้าที่จัดซื้อ'],
            ['name' => 'เจ้าหน้าที่เอกสารต่างประเทศ'],
            ['name' => 'ผู้จัดการแผนกความปลอดภัย/จป.วิชาชีพ'],
            ['name' => 'หัวหน้าแผนกบริหารแรงงานต่างชาติ'],
            ['name' => 'เจ้าหน้าที่บริหารงานสวัสดิการ'],
            ['name' => 'หัวหน้างานความปลอดภัย'],
            ['name' => 'พนักงานทั่วไป (ความปลอดภัย)'],
            ['name' => 'พนักงานทั่วไป ความปลอดภัย (ล่าม)'],
            ['name' => 'ผู้จัดการโรงงานแปรรูป'],
            ['name' => 'รองผู้จัดการแผนกโรงงานแปรรูป'],
            ['name' => 'รองหัวหน้าผลิตดิบ'],
            ['name' => 'รองหัวหน้าผลิต (มาริเนต)'],
            ['name' => 'หัวหน้าแผนกผลิตดิบ'],
            ['name' => 'รองหัวหน้าผลิตดิบ (คลังสินค้าภายใน)'],
            ['name' => 'พนักงานทั่วไป (ผลิตดิบ)'],
            ['name' => 'CHECKER (ผลิตดิบ)'],
            ['name' => 'หัวหน้าแผนกอนามัย'],
            ['name' => 'หัวหน้าอนามัย (โรงแปรรูป)'],
            ['name' => 'หัวหน้าอนามัย/HIGH RISK'],
            ['name' => 'หัวหน้าอนามัย/LOW RISK'],
            ['name' => 'รองหัวหน้าอนามัย (โรงแปรรูป)'],
            ['name' => 'รองหัวหน้าอนามัย/HIGH RISK'],
            ['name' => 'รองหัวหน้าอนามัย/LOW RISK'],
            ['name' => 'รองหัวหน้าอนามัย (ห้องผ้า)'],
            ['name' => 'รองหัวหน้าอนามัย (สำนักงาน)'],
            ['name' => 'CHECKER อนามัย (ซักผ้า)'],
            ['name' => 'พนักงานทั่วไป อนามัย (ซักผ้า)'],
            ['name' => 'CHECKER อนามัย (ผลิตดิบ)'],
            ['name' => 'พนักงานทั่วไป อนามัย (ผลิตดิบ)'],
            ['name' => 'CHECKER อนามัย (L/R)'],
            ['name' => 'พนักงานทั่วไป อนามัย (L/R)'],
            ['name' => 'CHECKER อนามัย (H/R)'],
            ['name' => 'พนักงานทั่วไป อนามัย (H/R)'],
            ['name' => 'ผู้จัดการแผนกสิ่งแวดล้อม'],
            ['name' => 'ผู้ปฏิบัติระบบบำบัดน้ำเสีย'],
            ['name' => 'เจ้าหน้าที่สิ่งแวดล้อม'],
            ['name' => 'พนักงานทั่วไป (สิ่งแวดล้อม)'],
            ['name' => 'CHECKER สิ่งแวดล้อม'],
            ['name' => 'เจ้าหน้าที่การตลาด']
            
        ];
        $chunks = array_chunk($userPositions, 50);
        foreach ($chunks as $key => $chunk) {
            UserPosition::insert($chunk);
        }
    }
}
